# Напишите программу, удаляющую из текста все слова, содержащие ""абв""
a = 'ыыаааыв абвплдвод ывааыабв вадлоы ылвдад ывдабв'
b = a.split()
c = [i for i in b if not 'абв' in i]
d = " ".join(c)
print(a)
print(d)
